sample/hashi/mb-op/nomad-mm-wrk-compose-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R7000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=7000
Running 30s test @ http://10.10.1.4:8080/wrk2-api/user-timeline/read
  4 threads and 512 connections
  Thread calibration: mean lat.: 3215.092ms, rate sampling interval: 12287ms
  Thread calibration: mean lat.: 3213.528ms, rate sampling interval: 12263ms
  Thread calibration: mean lat.: 3212.735ms, rate sampling interval: 12287ms
  Thread calibration: mean lat.: 3212.132ms, rate sampling interval: 11476ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.08s     4.42s   22.17s    57.57%
    Req/Sec   455.25      2.28   459.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.93s 
 75.000%   17.87s 
 90.000%   20.27s 
 99.000%   22.17s 
 99.900%   23.09s 
 99.990%   23.58s 
 99.999%   23.89s 
100.000%   23.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5214.207     0.000000            1         1.00
    8216.575     0.100000         3552         1.11
    9494.527     0.200000         7097         1.25
   10895.359     0.300000        10642         1.43
   12378.111     0.400000        14190         1.67
   13926.399     0.500000        17734         2.00
   14712.831     0.550000        19505         2.22
   15499.263     0.600000        21268         2.50
   16261.119     0.650000        23044         2.86
   17055.743     0.700000        24816         3.33
   17874.943     0.750000        26609         4.00
   18284.543     0.775000        27488         4.44
   18710.527     0.800000        28375         5.00
   19120.127     0.825000        29291         5.71
   19480.575     0.850000        30130         6.67
   19873.791     0.875000        31028         8.00
   20070.399     0.887500        31477         8.89
   20267.007     0.900000        31907        10.00
   20463.615     0.912500        32355        11.43
   20676.607     0.925000        32812        13.33
   20889.599     0.937500        33258        16.00
   21004.287     0.943750        33476        17.78
   21102.591     0.950000        33684        20.00
   21233.663     0.956250        33902        22.86
   21348.351     0.962500        34118        26.67
   21495.807     0.968750        34342        32.00
   21577.727     0.971875        34451        35.56
   21676.031     0.975000        34578        40.00
   21757.951     0.978125        34686        45.71
   21856.255     0.981250        34783        53.33
   21954.559     0.984375        34900        64.00
   22003.711     0.985938        34958        71.11
   22069.247     0.987500        35008        80.00
   22134.783     0.989062        35060        91.43
   22200.319     0.990625        35115       106.67
   22298.623     0.992188        35176       128.00
   22331.391     0.992969        35199       142.22
   22396.927     0.993750        35232       160.00
   22446.079     0.994531        35253       182.86
   22527.999     0.995313        35282       213.33
   22593.535     0.996094        35312       256.00
   22626.303     0.996484        35326       284.44
   22675.455     0.996875        35337       320.00
   22724.607     0.997266        35351       365.71
   22790.143     0.997656        35363       426.67
   22872.063     0.998047        35380       512.00
   22921.215     0.998242        35386       568.89
   22937.599     0.998437        35391       640.00
   22970.367     0.998633        35397       731.43
   23052.287     0.998828        35405       853.33
   23101.439     0.999023        35412      1024.00
   23117.823     0.999121        35415      1137.78
   23150.591     0.999219        35419      1280.00
   23166.975     0.999316        35422      1462.86
   23216.127     0.999414        35425      1706.67
   23281.663     0.999512        35428      2048.00
   23330.815     0.999561        35433      2275.56
   23330.815     0.999609        35433      2560.00
   23330.815     0.999658        35433      2925.71
   23363.583     0.999707        35435      3413.33
   23445.503     0.999756        35437      4096.00
   23461.887     0.999780        35438      4551.11
   23494.655     0.999805        35439      5120.00
   23494.655     0.999829        35439      5851.43
   23560.191     0.999854        35440      6826.67
   23576.575     0.999878        35441      8192.00
   23625.727     0.999890        35442      9102.22
   23625.727     0.999902        35442     10240.00
   23625.727     0.999915        35442     11702.86
   23658.495     0.999927        35443     13653.33
   23658.495     0.999939        35443     16384.00
   23707.647     0.999945        35444     18204.44
   23707.647     0.999951        35444     20480.00
   23707.647     0.999957        35444     23405.71
   23707.647     0.999963        35444     27306.67
   23707.647     0.999969        35444     32768.00
   23887.871     0.999973        35445     36408.89
   23887.871     1.000000        35445          inf
#[Mean    =    14078.691, StdDeviation   =     4419.399]
#[Max     =    23871.488, Total count    =        35445]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  55717 requests in 30.02s, 9.78MB read
  Socket errors: connect 0, read 0, write 0, timeout 47
Requests/sec:   1856.28
Transfer/sec:    333.55KB